app/controllers/foods_controller.rb

INSERT INTO "foods" ("name", "quantity", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "chips"], ["quantity", 2], ["created_at", "2020-12-11 18:48:54.431519"], ["updated_at", "2020-12-11 18:48:54.431519"]]
---
  def create
    @food = Food.new(food_params)

    if @food.save

UPDATE "foods" SET "quantity" = $1, "updated_at" = $2 WHERE "foods"."id" = $3  [["quantity", 4], ["updated_at", "2020-12-11 19:02:56.757890"], ["id", 2]]
---
  def update
    if @food.update(food_params)